---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricationPartDepthOutOption
source: html/af5546b5-fe67-2cea-5c0d-2af71d7fb913.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricationPartDepthOutOption Property

"Main Secondary Depth Option"

## Syntax (C#)
```csharp
public static ForgeTypeId FabricationPartDepthOutOption { get; }
```